"""
Փոփոխականներ անվանելու օրենքները՝
    1. Փոփոխականի անունը պետք է սկսվի տառային սիմվոլով կամ underscore-ով (տակի գծիկ` _)
    2․ Փոփոխականի անունը չի կարող սկսվել թվային սիմվոլով (0, 1, 2 և այլն․․․)
    3․ Փոփոխականի անունը կարող է պարունակել այբենաթվական սիմվոլներ (a-z, A-Z, 0-9) և underscore (_)
    4. Փոփոխականի անունը case-sensitive-է (age, AGE, Age դրանք երեք տարբեր փոփոխականներ են)

    Փայթնում (python) կոմենտ արվում է, օգտագործելով վանդականիշ սիմվոլը (#)։
    Եթե ցանկանում եք միանգամից կոմենտ անել (կամ եթե կոմենտ արված է՝ հանել կոմենտը) մեկից ավելի տողեր,
    կարող եք նշել տվյալ հատվածը, այնուհետև սեղմել ctrl + ? կոճակների համադրությունը

"""
"""
Մաս 1․ string տիպի փոփոխականներ, փոփոխականի տիպ
"""
x = "Andranik"
print(x)
# string -> str
print(type(x))

"""
Մաս 2․ int տիպի փոփոխականներ
"""
# integer -> int
y = 77
print(y)
print(type(y))

"""
Մաս 3․ float տիպի փոփոխականներ
"""
z = 26.5656545
print(z)
print(type(z))

"""
Մաս 4․ Թվաբանական գործողություններ
"""
print(2*y)
print(2/y)
print(2-y)
print(2+y)
